neltharion11/luxar-embedded-agent/workspace/projects/LedBlink/Core/Inc/stm32_hal_conf.h
#ifndef STM32_HAL_CONF_H
#define STM32_HAL_CONF_H

/* TODO(stage-2): tailor HAL module enables to the selected STM32 family. */
#define HAL_MODULE_ENABLED

#endif /* STM32_HAL_CONF_H */
